import z from "zod";

const formSchema = z.object({
  fullName: z
    .string()
    .regex(/^[آ-ی\s]+$/, "نام فقط باید شامل حروف فارسی باشد")
    .min(2, "نام باید حداقل 2 کاراکتر باشد")
    .max(50, "نام نمی‌تواند بیشتر از 50 کاراکتر باشد"),

  phone: z
    .string()
    .regex(/^09\d{9}$/, "شماره تلفن باید با 09 شروع شده و 11 رقم باشد"),

  email: z
    .string()
    .regex(
      /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/,
      "ایمیل معتبر نیست"
    ),

  subject: z
    .string()
    .regex(/^[آ-ی\s]+$/, "عنوان فقط باید شامل حروف فارسی باشد")
    .min(5, "عنوان باید حداقل 5 کاراکتر باشد")
    .max(50, "عنوان نمی‌تواند بیشتر از 50 کاراکتر باشد"),

  text: z
    .string()
    .regex(/^[آ-ی\s]+$/, "متن پیام فقط باید شامل حروف فارسی باشد")
    .max(1000, "متن پیام نمی‌تواند بیشتر از 1000 کاراکتر باشد"),
});

export default formSchema;
